console.log(
    "- вёрстка валидная +10\n"+
    "- вёрстка семантическая +20 \n"+
    "- в коде страницы присутствуют семантические теги HTML5: article +2, aside +2, footer +2, header +2, main +2, section +2, h1 +2, h2 +2, h3 +2 = 18 баллов\n"+
    "- для оформления СV используются css-стили +10\n"+
    "- контент размещается в блоке, который горизонтально центрируется на странице. Фоновый цвет, если он есть, тянется во всю ширину страницы +10\n"+
    "- вёрстка адаптивная: - \n"+
    "- есть адаптивное бургер-меню. - \n"+
    "- на странице СV присутствует изображение - фото или аватарка автора CV, пропорции изображения не искажены, у изображения есть атрибут alt (может быть пустым) +10\n"+
    "- контакты для связи и перечень навыков оформлены в виде списка ul > li +10\n"+
    "- CV содержит контакты для связи, краткую информацию о себе, перечень навыков, информацию об образовании и уровне английского +10\n"+
    "- CV содержит пример вашего кода (например, решение задачи с сайта codewars) с подсветкой кода. +10\n"+
    "- CV содержит изображения-ссылки на выполненные вами проекты. - \n"+
    "- CV выполнено на английском языке +10\n"+
    "- выполнены требования к Pull Request: есть ссылка на задание, скриншот страницы СV, ссылка на деплой страницы CV на GitHub Pages, выполнена самооценка (самооценку расписываем по пунктам критериев оценки, указывая балл за каждый пункт) +10\n"+
    "- есть видеорезюме автора CV на английском языке. - \n"+
    "- дизайн, оформление, качество выполнения CV не ниже чем в примерах CV, приведённых в материалах к заданию +10"
)