console.log("Оценка - 110 балла" +
"\nОтзыв по пунктам ТЗ:" + 
"\nНе выполненные/не засчитанные пункты:" +
"\n1) если видео с YouTube проигрывается, клик по кнопке Pause останавливает его проигрывание. Также проигрывание видео останавливается, если кликнуть по другому слайду или кнопке Play в центре другого слайда. В указанной ситуации другое видео должно запуститься, а текущее остановиться. Невозможно проигрывание нескольких YouTube видео одновременно " +
"\n2) если внутри слайда проигрывается видео с YouTube, клик по стрелке перелистывания слайдов или клик по буллету останавливает проигрывание видео " +
"\n3) есть возможность перелистывания слайдов с видео влево и вправо кликами по стрелкам. Слайды перелистываются по одному, при этом также меняется основное видео " +
"\n4) есть возможность перелистывания слайдов кликами по буллетам (кружочки внизу слайдера), при этом также меняется основное видео " +
"\n5) слайды перелистываются плавно с анимацией смещения вправо или влево (для смены основного видео анимация смещения не требуется и не проверяется) " +
"\n6) перелистывание слайдов бесконечное (зацикленное) " +
"\n7) при перелистывании слайдов буллет активного слайда подсвечивается (выделяется стилем) " +
"\n8) если основное видео проигрывалось при перелистывании слайдера, проигрывание видео останавливается, прогресс бар сдвигается к началу, иконки "Play" на панели управления и по центру видео меняются на первоначальные " +
"\n9) даже при частых кликах по стрелкам нет ситуации, когда слайд после перелистывания находится не по центру, нет ситуации, когда видны одновременно два слайда " +
"\n10) Клавиши SHIFT+, (англ) — ускорение воспроизведения ролика " +
"\n11) Клавиши SHIFT+. (англ) — замедление воспроизведения ролика " +
"\n12) при обновлении страницы сохраняется выбранное ранее количество билетов Basic и Senior, выбранный тип билета, общая цена за них " +
"\n13) стиль карты соответствует макету " +
"\n14) Любой собственный дополнительный функционал, улучшающий качество проекта. Например, ночная тема, плавная смена изображений в блоке Tickets, всплывающее окно с информацией про картины и их авторов, кнопка прокрутки страницы вверх, возможность проголосовать за понравившиеся картины с сохранением данных в local storage, всё зависит от вашей фантазии и чувства вкуса. Для удобства проверки выполненный вами дополнительный функционал включите в самооценку, которую выведите в консоль браузера " +
"\n\nЧастично выполненные пункты:" +
"\n1) при обновлении страницы, если она к тому моменту была прокручена до секции Galery, анимация картин повторяется " +
"\n2) валидация e-mail должна пропукать только адреса вида username@example.com, где: username - имя пользователя, должно содержать от 3 до 15 символов (буквы, цифры, знак подчёркивания, дефис), не должно содержать пробелов; @ - символ собачки; example - домен первого уровня состоит минимум из 4 латинских букв; com - домен верхнего уровня, отделяется от домена первого уровня точкой и состоит минимум из 2 латинских букв " +
"\n3) валидация номера телефона: номер содержит только цифры; без разделения или с разделением на две или три цифры; разделение цифр может быть через дефис или пробел; с ограничением по количеству цифр не больше 10 цифр " +
"\nfeedback: Работает для формата xxx-xxx-xx-xx или xxx xxx xx xx" +
"\n4) при попытке ввода в форму невалидного значения выводится предупреждение, например, 'номер телефона может содержать только цифры' " +
"\nfeedback: Задание на гитхабе выглядело так 'при попытке ввода в input невалидного значения, его граница подсвечивается красным, выводится текстовое предупреждение в человекочитаемом формате'" +
"\nЧастично выполнено, т.к. подсвечивается красным " +
"\n5) на карте отображаются маркеры, расположение и внешний вид маркеров соответствует макету " +
"\nfeedback: внешний вид маркеров не соответствует макету " +
"\n\nВсе остальные пункты выполнены ")   